In [1]:
import numpy as np
import pandas as pd

In [5]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series([1,2,3,])

0    1
1    2
2    3
dtype: int64

In [8]:
labels = ['USA','Germany','USSR','Japan']
my_list = [1,2,3,4]

In [10]:
pd.Series(my_list,labels)

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR','Japan'])

In [12]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [16]:
ser1['USA']

1

In [17]:
ser1[0]

1

In [48]:
df['new']=df['W']+df['Y']

In [51]:
from numpy.random import randn
np.random.seed(5)

df = pd.DataFrame(randn(5,5),index='A B C D E'.split(),columns='W X Y Z new'.split())

In [52]:

df['new']=df['W']+df['Y']

In [53]:
df

          W         X         Y         Z       new
A  0.441227 -0.330870  2.430771 -0.252092  2.871999
B  1.582481 -0.909232 -0.591637  0.187603  0.990844
C -1.192765 -0.204877 -0.358829  0.603472 -1.551594
D -0.700179  1.151391  1.857331 -1.511180  1.157152
E -0.980608 -0.856853 -0.871879 -0.422508 -1.852487

In [20]:
randn(row, column)

NameError: name 'row' is not defined

In [23]:
df = pd.DataFrame(randn(5,1),index='A B C D E'.split(),columns='W'.split())

In [24]:
df

          W
A -0.980608
B -0.856853
C -0.871879
D -0.422508
E  0.996440

In [27]:
df[['W']]

          W
A -0.980608
B -0.856853
C -0.871879
D -0.422508
E  0.996440

In [31]:
df[['W','Z']]

          W         Z
A  0.441227 -0.252092
B  0.109610 -0.591637
C  0.187603 -0.204877
D -0.358829 -0.700179
E  1.151391  0.644848

In [82]:
df

          W         X         Y         Z
A  2.871999 -0.330870  2.430771 -0.252092
B  0.990844 -0.909232 -0.591637  0.187603
C -1.551594 -0.204877 -0.358829  0.603472
D  1.157152  1.151391  1.857331 -1.511180
E -1.852487 -0.856853 -0.871879 -0.422508

In [58]:
df['W'] = df['W']+df['Y']

In [59]:
df

          W         X         Y         Z       new
A  2.871999 -0.330870  2.430771 -0.252092  2.871999
B  0.990844 -0.909232 -0.591637  0.187603  0.990844
C -1.551594 -0.204877 -0.358829  0.603472 -1.551594
D  1.157152  1.151391  1.857331 -1.511180  1.157152
E -1.852487 -0.856853 -0.871879 -0.422508 -1.852487

In [61]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.871999 -0.330870  2.430771 -0.252092
B  0.990844 -0.909232 -0.591637  0.187603
C -1.551594 -0.204877 -0.358829  0.603472
D  1.157152  1.151391  1.857331 -1.511180
E -1.852487 -0.856853 -0.871879 -0.422508

In [62]:
df.drop('new',axis=1,inplace=True)

In [63]:
df

          W         X         Y         Z
A  2.871999 -0.330870  2.430771 -0.252092
B  0.990844 -0.909232 -0.591637  0.187603
C -1.551594 -0.204877 -0.358829  0.603472
D  1.157152  1.151391  1.857331 -1.511180
E -1.852487 -0.856853 -0.871879 -0.422508

In [ ]:
# inplace = True라는 내용을 첨가해주면, df의 내용에 절대적으로 영향을 미침.

In [65]:
df.drop('E')

          W         X         Y         Z
A  2.871999 -0.330870  2.430771 -0.252092
B  0.990844 -0.909232 -0.591637  0.187603
C -1.551594 -0.204877 -0.358829  0.603472
D  1.157152  1.151391  1.857331 -1.511180

In [68]:
df.drop('E',axis = 0,inplace = False)

          W         X         Y         Z
A  2.871999 -0.330870  2.430771 -0.252092
B  0.990844 -0.909232 -0.591637  0.187603
C -1.551594 -0.204877 -0.358829  0.603472
D  1.157152  1.151391  1.857331 -1.511180

In [69]:
df.shape

          W         X         Y         Z
A  2.871999 -0.330870  2.430771 -0.252092
B  0.990844 -0.909232 -0.591637  0.187603
C -1.551594 -0.204877 -0.358829  0.603472
D  1.157152  1.151391  1.857331 -1.511180
E -1.852487 -0.856853 -0.871879 -0.422508

In [ ]:
# Tuple 형태
# 앞에 5는 row 수, 해당 인덱스는 0
# 뒤에 4는 column수, 해당 인덱스는 1

# Axis는 축이라는 뜻.
# Q. 왜,row를 drop할 때는 axis를 넣지 않아도 될까요?
# A. axis = 0은 없는것과 같기에 생략이 가능해서

In [70]:
df.loc[['A']]

          W        X         Y         Z
A  2.871999 -0.33087  2.430771 -0.252092

In [71]:
df.loc['A']

W    2.871999
X   -0.330870
Y    2.430771
Z   -0.252092
Name: A, dtype: float64

In [73]:
df.iloc[2]

W   -1.551594
X   -0.204877
Y   -0.358829
Z    0.603472
Name: C, dtype: float64

In [76]:
df.loc['B','Y']

-0.5916366579302884

In [78]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.871999  2.430771
B  0.990844 -0.591637

In [106]:
df>=0

       W      X      Y      Z
A   True  False   True  False
B   True  False  False   True
C  False  False  False   True
D   True   True   True  False
E  False  False  False  False

In [107]:
df.drop('W',axis = 0,inplace = True)

KeyError: "['W'] not found in axis"

In [ ]:
df.drop('W',axis = 0,inplace = True)

In [104]:
df.drop('W' ,axis=0)

KeyError: "['W'] not found in axis"

In [108]:
df[df['W']>0]

          W         X         Y         Z
A  2.871999 -0.330870  2.430771 -0.252092
B  0.990844 -0.909232 -0.591637  0.187603
D  1.157152  1.151391  1.857331 -1.511180

In [111]:
df[df['W']>0][['Y']]

          Y
A  2.430771
B -0.591637
D  1.857331

In [112]:
df[df['W']>0][['X','Y']]

          X         Y
A -0.330870  2.430771
B -0.909232 -0.591637
D  1.151391  1.857331

In [114]:
df[df['W']>0]['Y']

A    2.430771
B   -0.591637
D    1.857331
Name: Y, dtype: float64

In [115]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
A  2.871999 -0.330870  2.430771 -0.252092
D  1.157152  1.151391  1.857331 -1.511180

More Index Details부터 시작

In [6]:
from numpy.random import randn
np.random.seed(5)

df = pd.DataFrame(randn(4,4),index='John Mary Peter Paul'.split(),columns='Math Science English Coding'.split())
df

           Math   Science   English    Coding
John   0.441227 -0.330870  2.430771 -0.252092
Mary   0.109610  1.582481 -0.909232 -0.591637
Peter  0.187603 -0.329870 -1.192765 -0.204877
Paul  -0.358829  0.603472 -1.664789 -0.700179

In [13]:
score1 = [[40, 30, 60, 100],[90,100,20,30],[50,20,90,99],[10,40,100,90]]
df_score = pd.DataFrame(score1, index = 'john Mary Peter Paul'.split(),columns = 'Math Science English Coding'.split())
# pd.DataFrame(data명,index,columns)
#pd.DataFrame(data를 산출하는 함수(사이즈),index,columns)

In [14]:
df_score

       Math  Science  English  Coding
john     40       30       60     100
Mary     90      100       20      30
Peter    50       20       90      99
Paul     10       40      100      90

In [16]:
df_score['총점']=df_score['Math']+df_score['Science']+df_score['English']+df_score['Coding']

In [17]:
df_score

       Math  Science  English  Coding   총점
john     40       30       60     100  230
Mary     90      100       20      30  240
Peter    50       20       90      99  259
Paul     10       40      100      90  240

In [18]:
df_score.loc['Titus']=[80,30,60,90,260]

In [19]:
df_score

       Math  Science  English  Coding   총점
john     40       30       60     100  230
Mary     90      100       20      30  240
Peter    50       20       90      99  259
Paul     10       40      100      90  240
Titus    80       30       60      90  260

In [21]:
df_score["Music"]=[90,30,40,20,10]

In [22]:
df_score

       Math  Science  English  Coding   총점  Music
john     40       30       60     100  230     90
Mary     90      100       20      30  240     30
Peter    50       20       90      99  259     40
Paul     10       40      100      90  240     20
Titus    80       30       60      90  260     10

In [35]:
df_score['총점']=df_score['Math']+df_score['Science']+df_score['English']+df_score['Coding']+df_score['Music']

In [36]:
df_score

       Math  Science  English  Coding  Music   총점
john     40       30       60     100     90  320
Mary     90      100       20      30     30  270
Peter    50       20       90      99     40  299
Paul     10       40      100      90     20  260
Titus    80       30       60      90     10  270

In [33]:
df_score = df_score[['Math', 'Science', 'English', 'Coding', 'Music', '총점']]
# 컬럼명 재정렬을 위해 위 코드가 필요

In [34]:
df_score["총점"] = df_score['Math']+df_score['science']+df_score['English']+df_score['Coding']+df_score['Music']

KeyError: 'science'

In [37]:
df_score['평균']=(df_score['Math']+df_score['Science']+df_score['English']+df_score['Coding']+df_score['Music'])/5

In [38]:
df_score

       Math  Science  English  Coding  Music   총점    평균
john     40       30       60     100     90  320  64.0
Mary     90      100       20      30     30  270  54.0
Peter    50       20       90      99     40  299  59.8
Paul     10       40      100      90     20  260  52.0
Titus    80       30       60      90     10  270  54.0

In [39]:
df_score[(df_score['Coding']>50)&(df_score['Math']>50)]
# & : 교집합, 다중의 조건을 모두 만족시킴
# | : or,합집합,다중의 조건 중 하나만 만족시켜도 okay

       Math  Science  English  Coding  Music   총점    평균
Titus    80       30       60      90     10  270  54.0

In [40]:
from numpy.random import randn
np.random.seed(5)

df = pd.DataFrame(randn(5,5),index='A B C D E'.split(),columns='W X Y Z new'.split())

In [42]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  0.441227 -0.330870  2.430771 -0.252092  0.109610
1     B  1.582481 -0.909232 -0.591637  0.187603 -0.329870
2     C -1.192765 -0.204877 -0.358829  0.603472 -1.664789
3     D -0.700179  1.151391  1.857331 -1.511180  0.644848
4     E -0.980608 -0.856853 -0.871879 -0.422508  0.996440

In [43]:
df['States']=['CA','NY','WY','OR','CO']

In [44]:
df

          W         X         Y         Z       new States
A  0.441227 -0.330870  2.430771 -0.252092  0.109610     CA
B  1.582481 -0.909232 -0.591637  0.187603 -0.329870     NY
C -1.192765 -0.204877 -0.358829  0.603472 -1.664789     WY
D -0.700179  1.151391  1.857331 -1.511180  0.644848     OR
E -0.980608 -0.856853 -0.871879 -0.422508  0.996440     CO

In [45]:
df.set_index('States')

               W         X         Y         Z       new
States
CA      0.441227 -0.330870  2.430771 -0.252092  0.109610
NY      1.582481 -0.909232 -0.591637  0.187603 -0.329870
WY     -1.192765 -0.204877 -0.358829  0.603472 -1.664789
OR     -0.700179  1.151391  1.857331 -1.511180  0.644848
CO     -0.980608 -0.856853 -0.871879 -0.422508  0.996440

In [46]:
df.set_index('States',inplace = True)

In [47]:
df

               W         X         Y         Z       new
States
CA      0.441227 -0.330870  2.430771 -0.252092  0.109610
NY      1.582481 -0.909232 -0.591637  0.187603 -0.329870
WY     -1.192765 -0.204877 -0.358829  0.603472 -1.664789
OR     -0.700179  1.151391  1.857331 -1.511180  0.644848
CO     -0.980608 -0.856853 -0.871879 -0.422508  0.996440

In [56]:
# index Levels
Outside = ['G1','G1','G1','G2','G2','G2']
Inside = [1,2,3,1,2,3]
hier_index = list(zip(Outside,Inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [57]:
Outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [58]:
Inside

[1, 2, 3, 1, 2, 3]

In [59]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [61]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.712421  0.059144
   2 -0.363311  0.003289
   3 -0.105930  0.793053
G2 1 -0.631572 -0.006195
   2 -0.101068 -0.052308
   3  0.249218  0.197660

In [65]:
df.loc['G1']

          A         B
1  0.712421  0.059144
2 -0.363311  0.003289
3 -0.105930  0.793053

In [67]:
df.loc['G1'].iloc[1]

A   -0.363311
B    0.003289
Name: 2, dtype: float64

In [69]:
score2 = [[30,60],[100,50],[10,20],[90,80],[44,41],[70,77]]

In [71]:
df_score2 = pd.DataFrame(score2, index=hier_index, columns=['수학','영어'])

In [72]:
df_score2

       수학  영어
G1 1   30  60
   2  100  50
   3   10  20
G2 1   90  80
   2   44  41
   3   70  77

In [73]:
df_score2.loc["G1"].loc[1][1]

60

In [74]:
df_score2.loc["G2"].loc[2][0]

44

In [75]:
df_score2.loc['G1']['영어'].iloc[0]

60

In [76]:
df_score2.loc['G2']['수학'].iloc[1]

44

In [77]:
score2 = [[30,60],[100,50],[10,20],[90,80],[44,41],[70,77]]

In [78]:
df_score2 = pd.DataFrame(score2, index=hier_index, columns=['수학','영어'])

In [79]:
df_score2

       수학  영어
G1 1   30  60
   2  100  50
   3   10  20
G2 1   90  80
   2   44  41
   3   70  77

In [80]:
df_score2.index.names = ['반','번호']

In [81]:
df_score2

        수학  영어
반  번호
G1 1    30  60
   2   100  50
   3    10  20
G2 1    90  80
   2    44  41
   3    70  77